ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l210x/LCD_1.0.xml
    <register id="LCD_LCDPCTL3" width="32" offset="0x1120" description="LCD port control  register 3">
        <bitfield id="LCDS48" description="LCD pin 48 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS49" description="LCD pin 49 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS50" description="LCD pin 50 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS51" description="LCD pin 51 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS52" description="LCD pin 52 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS53" description="LCD pin 53 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS54" description="LCD pin 54 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS55" description="LCD pin 55 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS56" description="LCD pin 56 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS57" description="LCD pin 57 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS58" description="LCD pin 58 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS59" description="LCD pin 59 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS60" description="LCD pin 60 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS61" description="LCD pin 61 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS62" description="LCD pin 62 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS63" description="LCD pin 63 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
    </register>
