ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l210x/LCD_1.0.xml
    <register id="LCD_LCDCSSEL0" width="32" offset="0x1128" description="LCD common segment select register 0">
        <bitfield id="LCDCSS0" description="Selects pin L0 as either common or segment line.  0b = Segment line 1b = Common line" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS1" description="Selects pin L1 as either common or segment line.  0b = Segment line 1b = Common line" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS10" description="Selects pin L10 as either common or segment line.  0b = Segment line 1b = Common line" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS11" description="Selects pin L11 as either common or segment line.  0b = Segment line 1b = Common line" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS12" description="Selects pin L12 as either common or segment line.  0b = Segment line 1b = Common line" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS13" description="Selects pin L13 as either common or segment line.  0b = Segment line 1b = Common line" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS14" description="Selects pin L14 as either common or segment line.  0b = Segment line 1b = Common line" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS15" description="Selects pin L15 as either common or segment line.  0b = Segment line 1b = Common line" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS2" description="Selects pin L2 as either common or segment line.  0b = Segment line 1b = Common line" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS3" description="Selects pin L3 as either common or segment line.  0b = Segment line 1b = Common line" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS4" description="Selects pin L4 as either common or segment line.  0b = Segment line 1b = Common line" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS5" description="Selects pin L5 as either common or segment line.  0b = Segment line 1b = Common line" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS6" description="Selects pin L6 as either common or segment line.  0b = Segment line 1b = Common line" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS7" description="Selects pin L7 as either common or segment line.  0b = Segment line 1b = Common line" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS8" description="Selects pin L8 as either common or segment line.  0b = Segment line 1b = Common line" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS9" description="Selects pin L9 as either common or segment line.  0b = Segment line 1b = Common line" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
    </register>
    <register id="LCD_LCDCSSEL1" width="32" offset="0x112C" description="LCD common segment select register 1">
        <bitfield id="LCDCSS16" description="Selects pin L16 as either common or segment line.  0b = Segment line 1b = Common line" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS17" description="Selects pin L17 as either common or segment line.  0b = Segment line 1b = Common line" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS18" description="Selects pin L18 as either common or segment line.  0b = Segment line 1b = Common line" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS19" description="Selects pin L19 as either common or segment line.  0b = Segment line 1b = Common line" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS20" description="Selects pin L20 as either common or segment line.  0b = Segment line 1b = Common line" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS21" description="Selects pin L21 as either common or segment line.  0b = Segment line 1b = Common line" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS22" description="Selects pin L22 as either common or segment line.  0b = Segment line 1b = Common line" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS23" description="Selects pin L23 as either common or segment line.  0b = Segment line 1b = Common line" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS24" description="Selects pin L24 as either common or segment line.  0b = Segment line 1b = Common line" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS25" description="Selects pin L25 as either common or segment line.  0b = Segment line 1b = Common line" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS26" description="Selects pin L26 as either common or segment line.  0b = Segment line 1b = Common line" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS27" description="Selects pin L27 as either common or segment line.  0b = Segment line 1b = Common line" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS28" description="Selects pin L28 as either common or segment line.  0b = Segment line 1b = Common line" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS29" description="Selects pin L29 as either common or segment line.  0b = Segment line 1b = Common line" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS30" description="Selects pin L30 as either common or segment line.  0b = Segment line 1b = Common line" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS31" description="Selects pin L31 as either common or segment line.  0b = Segment line 1b = Common line" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
    </register>
