ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l210x/LCD_1.0.xml
    <register id="LCD_LCDBM" width="8" offset="0x1180" instances="32" instaddr="0x1" description="LCD blinking memory index register">
        <bitfield id="MBIT0" description="If LCD L[2*index] is selected as segment line (LCDCSS[2*index] = 0b) and LCD mux rate is static, 2-, 3- or 4-mux (000b &lt;= LCDMXx &lt;= 011b) 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index] is selected as common line (LCDCSS[2*index] = 1b): 0b = Pin L[2*index] not used as COM0 1b = Pin L[2*index] is used as COM0 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 5-, 6-, 7- or 8-mux (LCDMXx &gt;= 100b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L(index) not used as COM0 1b = Pin L(index) is used as COM0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
        <bitfield id="MBIT1" description="If LCD pin L[2*index] is selected as segment line (LCDCSS[2*index] = 0b) and LCD mux rate is 2-, 3- or 4-mux (001b &lt;= LCDMXx &lt;= 011b): 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index] is selected as common line (LCDCSS[2*index] = 1b): 0b = Pin L[2*index] not used as COM1 1b = Pin L[2*index] is used as COM1 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 5-, 6-, 7- or 8-mux (LCDMXx &gt;= 100b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L(index) not used as COM1 1b = Pin L(index) is used as COM1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
        <bitfield id="MBIT2" description="If LCD pin L[2*index] is selected as segment line (LCDCSS[2*index] = 0b) and LCD mux rate is 3- or 4-mux (010b &lt;= LCDMXx &lt;= 011b): 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index] is selected as common line (LCDCSS[2*index] = 1b): 0b = Pin L[2*index] not used as COM2 1b = Pin L[2*index] is used as COM2 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 5-, 6-, 7- or 8-mux (LCDMXx &gt;= 100b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L[index-1] not used as COM2 1b = Pin L[index-1] is used as COM2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
        <bitfield id="MBIT3" description="If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 4-mux (LCDMXx=011b): 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index] is selected as common line (LCDCSS[2*index] = 1b): 0b = Pin L[2*index] not used as COM3 1b = Pin L[2*index] is used as COM3 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 5-, 6-, 7- or 8-mux (LCDMXx &gt;= 100b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L(index) not used as COM3 1b = Pin L(index) is used as COM3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
        <bitfield id="MBIT4" description="If LCD pin L[2*index+1] is selected as segment line (LCDCSS[2*index+1] = 0b) and LCD mux rate is static, 2-, 3- or 4-mux (000b &lt;= LCDMXx &lt;= 011b) 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index+1] is selected as common line (LCDCSS[2*index+1] = 1b): 0b = Pin L[2*ndex+1] not used as COM0 1b = Pin L[2*ndex+1] is used as COM0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
        <bitfield id="MBIT5" description="If LCD pin L[2*index+1] is selected as segment line (LCDCSS[2*index+1] = 0b) and LCD mux rate is 2-, 3- or 4-mux (001b &lt;= LCDMXx &lt;= 011b): 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index+1] is selected as common line (LCDCSS[2*index+1] = 1b): 0b = Pin L[2*index+1] not used as COM1 1b = Pin L[2*index+1] is used as COM1 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 6-, 7- or 8-mux (LCDMXx &gt;= 101b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L(index) not used as COM5 1b = Pin L(index) is used as COM5" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
        <bitfield id="MBIT6" description="If LCD pin L[2*index+1] is selected as segment line (LCDCSS[2*index+1] = 0b) and LCD mux rate is 3- or 4-mux (010b &lt;= LCDMXx &lt;= 011b): 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index+1] is selected as common line (LCDCSS[2*index+1] = 1b): 0b = Pin L[2*index+1] not used as COM2 1b = Pin L[2*index+1] is used as COM2 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 7- or 8-mux (LCDMXx &gt;= 110b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L(index) not used as COM6 1b = Pin L(index) is used as COM6" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
        <bitfield id="MBIT7" description="If LCD pin L[2*index+1] is selected as segment line (LCDCSS[2*index+1] = 0b) and LCD mux rate is 4-mux (LCDMXx=011b): 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index+1] is selected as common line (LCDCSS[2*index+1] = 1b): 0b = Pin L[2*index+1] not used as COM3 1b = Pin L[2*index+1] is used as COM3 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 8-mux (LCDMXx = 111b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L(index) not used as COM7 1b = Pin L(index) is used as COM7" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
    </register>

</module>